---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.ElementTypeDuplicatingEventArgs
source: html/898fc422-e959-f46f-e58d-58c6cb393bc2.htm
---
# ElementTypeDuplicatingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.